{
  "makara-sankranti": {
    "name": "Makara Sankranti / Pongal",
    "date": "2026-01-14",
    "day": "Wednesday",
    "description": "Makara Sankranti marks the Sun's transition into Capricorn (Makara Rashi) and the beginning of Uttarayana, the auspicious six-month period when the Sun moves northward. This harvest festival is celebrated across India with different names - Pongal in Tamil Nadu, Lohri in Punjab, and Sankranti in Telugu states. It's a time to thank the Sun God for a bountiful harvest and celebrate nature's abundance.",
    "significance": "Makara Sankranti holds immense astronomical and spiritual significance. It marks the end of the winter solstice and the beginning of longer days, symbolizing the victory of light over darkness. According to Hindu scriptures, Uttarayana is considered highly auspicious for spiritual practices, sacred rituals, and important life events. The day is ideal for holy dips in sacred rivers, charity, and prayers to the Sun God.",
    "rituals": [
      "Taking holy dips in sacred rivers like Godavari and Krishna at sunrise",
      "Offering prayers to Surya (Sun God) and performing Surya Namaskar",
      "Preparing and sharing til-jaggery sweets (ellu-bella) with family and neighbors",
      "Flying colorful kites to celebrate the Sun's northward journey",
      "Cooking traditional Pongal (sweet rice) in new earthen pots",
      "Decorating homes with fresh mango leaves and colorful rangoli",
      "Giving charity - food grains, clothes, and money to the needy",
      "Worshipping cattle on Kanuma day (January 15) for their contribution to agriculture"
    ],
    "celebration": "Makara Sankranti is celebrated over three days. Bhogi (Day 1) involves discarding old items in bonfires symbolizing new beginnings. Sankranti (Day 2) is the main day when people take holy baths, prepare traditional foods, and offer prayers. Kanuma (Day 3) is dedicated to cattle worship. Families gather, exchange til-jaggery sweets while saying 'speak sweet words', and enjoy traditional delicacies like ariselu, chakara pongali, and pulihora.",
    "tithi": "Pausha Masa, Makara Sankranti Day",
    "nakshatra": "Varies based on lunar position",
    "masa": "Pausha",
    "paksha": "N/A (Solar event)"
  },
  "maha-shivaratri": {
    "name": "Maha Shivaratri",
    "date": "2026-02-26",
    "day": "Thursday",
    "description": "Maha Shivaratri, the 'Great Night of Shiva', is one of the most significant festivals dedicated to Lord Shiva. Celebrated on the Chaturdashi (14th day) of the dark fortnight in Magha or Phalguna month, this night is believed to be when Lord Shiva performed the Tandava (cosmic dance). Devotees observe fasting, stay awake throughout the night, and perform abhishekam (ritual bathing) of Shiva Lingam.",
    "significance": "Maha Shivaratri commemorates multiple divine events - Lord Shiva's marriage to Goddess Parvati, the manifestation of Shiva as the infinite column of light (Jyotirlinga), and Shiva consuming the poison from Samudra Manthan to save the universe. Spiritually, this night represents the convergence of Shiva and Shakti energies, creating a powerful natural upsurge ideal for meditation and inner transformation. Sincere worship on this day is believed to absolve sins and bestow moksha (liberation).",
    "rituals": [
      "Observing complete or partial fast from sunrise to next morning",
      "Staying awake throughout the night (Jagaran) in devotion to Shiva",
      "Performing abhishekam of Shiva Lingam with milk, curd, honey, and ghee during four prahars",
      "Offering bilva (bael) leaves in sets of three to Shiva Lingam",
      "Chanting 'Om Namah Shivaya' and Maha Mrityunjaya mantra continuously",
      "Visiting Shiva temples and participating in night-long bhajans and kirtans",
      "Lighting lamps and incense, offering white flowers and fruits",
      "Breaking the fast next morning after completing the 4th prahar puja"
    ],
    "celebration": "Devotees begin the day with an oil bath before sunrise and wear clean clothes. Throughout the night, they perform puja in four prahars (quarters), each with specific offerings - milk in 1st prahar, curd in 2nd, ghee in 3rd, and honey in 4th. The midnight period (Nishita Kala) is considered most auspicious. Temples organize special pujas, abhishekams, and cultural programs. Devotees stay awake chanting mantras, singing bhajans, and meditating, breaking their fast only after sunrise.",
    "tithi": "Magha Krishna Chaturdashi",
    "nakshatra": "Varies each year",
    "masa": "Magha",
    "paksha": "Krishna Paksha (Dark Fortnight)"
  },
  "ugadi": {
    "name": "Ugadi (Telugu New Year)",
    "date": "2026-03-21",
    "day": "Saturday",
    "description": "Ugadi, derived from 'Yuga Adi' meaning 'beginning of an era', marks the Telugu and Kannada New Year. Celebrated on Chaitra Shukla Pratipada (first day of Chaitra month), it coincides with the spring season when nature rejuvenates. According to legend, Lord Brahma began creation on this day. Ugadi symbolizes new beginnings, renewal of life, and the start of a fresh cosmic cycle.",
    "significance": "Ugadi holds profound spiritual and cultural significance. It's believed that Lord Brahma created the universe on this day, making it the beginning of time itself. The festival falls around the spring equinox, symbolizing balance and harmony. Spiritually, it's an auspicious time for new ventures, setting goals, and spiritual renewal. The famous Ugadi Pachadi, with its six tastes, teaches the important life lesson of accepting all experiences - both sweet and bitter - with equanimity.",
    "rituals": [
      "Taking oil bath (Abhyanga Snanam) early morning before sunrise",
      "Decorating homes with fresh mango leaf torans and colorful rangoli",
      "Performing Kalasha Sthapana and invoking Lord Brahma",
      "Listening to Panchanga Sravanam (reading of new year's almanac predictions)",
      "Preparing and sharing Ugadi Pachadi with all six tastes representing life's experiences",
      "Wearing new clothes and visiting temples",
      "Giving charity (Danam) to the needy - considered highly meritorious",
      "Family gatherings and sharing traditional delicacies"
    ],
    "celebration": "Ugadi celebrations begin with an oil bath and wearing new traditional clothes. Homes are decorated with mango leaves and rangoli. The highlight is Ugadi Pachadi, prepared with six ingredients representing life's six emotions - neem flowers (bitterness), jaggery (happiness), tamarind (challenges), chili (anger), salt (fear), and raw mango (surprises). The Panchanga (almanac) for the new year is read, predicting rainfall, crops, and auspicious times. Families prepare special dishes like Bobbatlu, Pulihora, and enjoy festive meals together.",
    "tithi": "Chaitra Shukla Pratipada",
    "nakshatra": "Ashwini",
    "masa": "Chaitra",
    "paksha": "Shukla Paksha (Bright Fortnight)"
  },
  "rama-navami": {
    "name": "Sri Rama Navami",
    "date": "2026-04-02",
    "day": "Thursday",
    "description": "Sri Rama Navami celebrates the birth of Lord Rama, the seventh avatar of Lord Vishnu and the hero of the epic Ramayana. Observed on the ninth day (Navami) of Chaitra Shukla Paksha, this festival commemorates the birth of the ideal king who exemplified dharma, righteousness, and virtue. Lord Rama is worshipped as the embodiment of truth, morality, and devotion.",
    "significance": "Rama Navami is one of the most important festivals for Hindus, especially Vaishnavites. Lord Rama's life teaches us the values of righteousness, duty, devotion, and compassion. His unwavering commitment to truth and dharma, even in the face of adversity, makes him an eternal role model. The festival reminds devotees to follow the path of righteousness and uphold moral values in daily life.",
    "rituals": [
      "Observing fast and breaking it only after the midday puja",
      "Reading or listening to the Ramayana, especially the birth chapter (Bala Kanda)",
      "Performing special puja to Lord Rama with tulsi leaves, flowers, and fruits",
      "Chanting 'Sri Rama Jaya Rama' mantra throughout the day",
      "Offering panchamritam (mixture of milk, curd, ghee, honey, and sugar) to Lord Rama",
      "Visiting Rama temples and participating in processions (Ratha Yatra)",
      "Organizing bhajan and kirtan sessions celebrating Rama's glory",
      "Giving charity and feeding the poor"
    ],
    "celebration": "Devotees wake up early, take a bath, and perform puja to Lord Rama. Temples conduct special abhishekams and decorate the deity with flowers and jewels. The Ramayana is recited continuously, with special emphasis on Rama's birth. Many devotees observe fast, consuming only fruits and milk. In the afternoon, prasadam is distributed. Cultural programs depicting scenes from Ramayana are performed. The festival culminates with aarti and distribution of prasadam.",
    "tithi": "Chaitra Shukla Navami",
    "nakshatra": "Punarvasu",
    "masa": "Chaitra",
    "paksha": "Shukla Paksha (Bright Fortnight)"
  },
  "hanuman-jayanti": {
    "name": "Hanuman Jayanti",
    "date": "2026-04-08",
    "day": "Wednesday",
    "description": "Hanuman Jayanti celebrates the birth of Lord Hanuman, the devoted follower of Lord Rama and a central character in the Ramayana. Observed on Chaitra Purnima (full moon day of Chaitra month), this festival honors the monkey god known for his incredible strength, unwavering devotion, and selfless service. Hanuman is worshipped as the symbol of courage, strength, and devotion.",
    "significance": "Lord Hanuman represents the ideal devotee - humble, fearless, and completely dedicated to his lord. His life exemplifies how devotion and surrender can help overcome any obstacle. Hanuman is also revered as Sankat Mochan (remover of difficulties) and is believed to protect devotees from evil spirits and negative energies. Worshipping Hanuman on his birth anniversary brings strength, courage, and removes obstacles from life.",
    "rituals": [
      "Visiting Hanuman temples early morning",
      "Applying sindoor (vermillion) to Hanuman's idol",
      "Offering jasmine flowers, betel leaves, and bananas",
      "Reciting Hanuman Chalisa 108 times",
      "Reading Sundara Kanda from the Ramayana",
      "Observing fast and consuming only fruits and milk",
      "Distributing prasadam (especially laddus and bananas)",
      "Organizing processions carrying Hanuman's idol"
    ],
    "celebration": "Devotees begin the day by visiting Hanuman temples where special pujas are performed. The idol is decorated with flowers and sindoor. Hanuman Chalisa is chanted continuously throughout the day. Many devotees observe fast, breaking it only in the evening after offering prayers. Temples organize wrestling competitions and physical fitness demonstrations to honor Hanuman's strength. Cultural programs depicting Hanuman's exploits from the Ramayana are performed.",
    "tithi": "Chaitra Purnima",
    "nakshatra": "Varies",
    "masa": "Chaitra",
    "paksha": "Shukla Paksha (Bright Fortnight)"
  },
  "krishna-janmashtami": {
    "name": "Krishna Janmashtami",
    "date": "2026-08-22",
    "day": "Saturday",
    "description": "Krishna Janmashtami celebrates the birth of Lord Krishna, the eighth avatar of Lord Vishnu. Born at midnight on the eighth day (Ashtami) of Krishna Paksha in Bhadrapada month, Lord Krishna is one of the most beloved deities in Hinduism. He is worshipped as the supreme deity who delivered the Bhagavad Gita and taught the path of dharma through his life.",
    "significance": "Lord Krishna's life is filled with divine plays (leelas) that teach profound spiritual lessons. From his childhood pranks to his role in the Mahabharata war, Krishna showed how to live with joy, wisdom, and devotion. The Bhagavad Gita, Krishna's divine discourse to Arjuna, is considered one of the greatest spiritual texts. Janmashtami reminds us to seek the divine in everyday life and perform our duties without attachment to results.",
    "rituals": [
      "Observing fast throughout the day, breaking it only after midnight",
      "Decorating cradles for baby Krishna with flowers and peacock feathers",
      "Performing special abhishekam at midnight with panchamritam",
      "Offering butter, milk sweets, and favorite foods of Krishna",
      "Singing devotional songs and bhajans celebrating Krishna's birth",
      "Organizing Dahi Handi (pot-breaking) events",
      "Reading Krishna's birth story from Bhagavata Purana",
      "Staying awake till midnight for the birth ceremony"
    ],
    "celebration": "Devotees observe fast and prepare for the midnight celebration when Krishna was born. Temples and homes are decorated with flowers, lights, and rangoli. A cradle is beautifully decorated for baby Krishna. At midnight, the birth is celebrated with temple bells, conch shells, and devotional singing. Special abhishekam is performed, and baby Krishna is placed in the cradle. Prasadam including butter, milk sweets, and fruits is distributed. Dahi Handi celebrations involve groups forming human pyramids to break pots filled with curd.",
    "tithi": "Bhadrapada Krishna Ashtami",
    "nakshatra": "Rohini",
    "masa": "Bhadrapada",
    "paksha": "Krishna Paksha (Dark Fortnight)"
  },
  "vinayaka-chavithi": {
    "name": "Vinayaka Chavithi",
    "date": "2026-08-29",
    "day": "Saturday",
    "description": "Vinayaka Chavithi (also known as Ganesh Chaturthi) celebrates the birth of Lord Ganesha, the elephant-headed god of wisdom, prosperity, and good fortune. Observed on the fourth day (Chaturthi) of Bhadrapada Shukla Paksha, this festival is celebrated with great enthusiasm across Telugu states. Lord Ganesha, the remover of obstacles and the lord of beginnings, is worshipped at the start of any new venture.",
    "significance": "Lord Ganesha is the first deity to be worshipped in any Hindu ritual as he removes obstacles and ensures success. His elephant head symbolizes wisdom and his large ears represent the ability to listen. Ganesha teaches us humility, intelligence, and the importance of knowledge. Worshipping Ganesha on his birthday brings prosperity, success, and removes obstacles from one's path.",
    "rituals": [
      "Installing clay Ganesha idols in homes and public pandals",
      "Performing Ganesh Sthapana with Vedic mantras",
      "Offering modakas (sweet dumplings), laddus, and favorite foods of Ganesha",
      "Chanting 'Om Gan Ganapataye Namaha' and Ganapati Atharvashirsha",
      "Worshipping with 21 varieties of leaves (Ekavimshati Patram)",
      "Organizing cultural programs and competitions",
      "Performing visarjan (immersion) after the worship period",
      "Observing the moon-viewing restriction on Chavithi day"
    ],
    "celebration": "Families bring home eco-friendly Ganesha idols and install them with proper rituals. The idol is worshipped for 1, 3, 5, 7, or 11 days depending on family tradition. Daily pujas include offering flowers, durva grass, and modakas. Special aartis are performed morning and evening. On the final day, the idol is taken in a procession with music and dance, and immersed in a water body while chanting 'Ganapati Bappa Morya, Purchya Varshi Lavkar Ya' (Come back soon next year).",
    "tithi": "Bhadrapada Shukla Chaturthi",
    "nakshatra": "Varies",
    "masa": "Bhadrapada",
    "paksha": "Shukla Paksha (Bright Fortnight)"
  },
  "dasara": {
    "name": "Dasara / Vijayadashami",
    "date": "2026-10-12",
    "day": "Monday",
    "description": "Dasara (also known as Vijayadashami or Dussehra) marks the victory of good over evil. It celebrates Goddess Durga's victory over the demon Mahishasura and Lord Rama's victory over Ravana. Observed on the tenth day (Dashami) of Ashwina Shukla Paksha, it concludes the nine-night Navratri festival. This day symbolizes the triumph of righteousness over evil forces.",
    "significance": "Dasara has multiple significances - it commemorates Durga's victory over Mahishasura representing the victory of shakti over evil, Rama's victory over Ravana showing dharma's triumph, and in some traditions, the day Pandavas retrieved their weapons after exile. The festival teaches that truth and righteousness always prevail. It's considered highly auspicious for starting new ventures, education, and learning new skills.",
    "rituals": [
      "Performing Ayudha Puja (worshipping tools, vehicles, and instruments)",
      "Organizing Saraswati Puja for books and learning materials",
      "Burning effigies of Ravana, Kumbhakarna, and Meghnad",
      "Seeking blessings of elders and teachers",
      "Starting new learning or business ventures (considered highly auspicious)",
      "Worshipping weapons and tools with flowers and kumkum",
      "Exchanging Apta (Bauhinia) leaves as symbol of gold",
      "Visiting temples and participating in processions"
    ],
    "celebration": "The day begins with special pujas to Goddess Durga and Saraswati. Tools, books, vehicles, and instruments are cleaned and worshipped as they are considered forms of the divine. In many places, large effigies of Ravana are burned in the evening, accompanied by fireworks and celebrations. Children are initiated into learning (Vidyarambham). The exchanging of Apta leaves symbolizes wishing prosperity to each other. Cultural programs and Ram Leela performances conclude the Navratri celebrations.",
    "tithi": "Ashwina Shukla Dashami",
    "nakshatra": "Varies",
    "masa": "Ashwina",
    "paksha": "Shukla Paksha (Bright Fortnight)"
  },
  "dussehra": {
    "name": "Dussehra",
    "date": "2026-10-12",
    "day": "Monday",
    "description": "Dussehra (same as Dasara/Vijayadashami) celebrates the victory of Lord Rama over the demon king Ravana. This festival marks the end of Navratri and symbolizes the triumph of good over evil. According to the Ramayana, after a fierce battle lasting ten days, Rama defeated Ravana and rescued his wife Sita from captivity in Lanka.",
    "significance": "Dussehra represents the victory of dharma (righteousness) over adharma (unrighteousness). Ravana, despite being a learned Brahmin and great devotee of Shiva, was defeated due to his ego and misdeeds. The festival teaches that knowledge without virtue leads to destruction, and no matter how powerful evil may seem, truth and righteousness will ultimately prevail. It's an auspicious day to begin new ventures and seek victory in all endeavors.",
    "rituals": [
      "Burning large effigies of Ravana, his brother Kumbhakarna, and son Meghnad",
      "Organizing Ram Leela performances depicting Ramayana stories",
      "Performing special pujas to Lord Rama and Goddess Durga",
      "Worshipping the Shami tree (believed to hold divine weapons)",
      "Exchanging Apta leaves symbolizing gold and prosperity",
      "Seeking blessings from elders (considered very auspicious)",
      "Starting new educational pursuits (Vidyarambham ceremony)",
      "Visiting temples and participating in victory processions"
    ],
    "celebration": "The day culminates with the spectacular burning of Ravana effigies filled with fireworks, symbolizing the destruction of evil. Ram Leela troupes perform the final battle between Rama and Ravana. Arrows of fire are shot at the effigies amid loud cheers and celebration. The burning of Ravana is not just an external ritual but symbolizes burning the evil tendencies within ourselves - ego, anger, greed, and jealousy. Cultural programs and fairs are organized across cities and towns.",
    "tithi": "Ashwina Shukla Dashami",
    "nakshatra": "Varies",
    "masa": "Ashwina",
    "paksha": "Shukla Paksha (Bright Fortnight)"
  },
  "deepavali": {
    "name": "Deepavali (Diwali)",
    "date": "2026-10-31",
    "day": "Saturday",
    "description": "Deepavali, the festival of lights, is one of the most celebrated Hindu festivals. Observed on Amavasya (new moon) of Ashwina/Kartika month, it symbolizes the victory of light over darkness, good over evil, and knowledge over ignorance. The festival is associated with Lord Rama's return to Ayodhya after 14 years of exile and defeating Ravana.",
    "significance": "Deepavali has multiple significances - it marks Lord Rama's return to Ayodhya, Lord Krishna's victory over the demon Narakasura, and the worship of Goddess Lakshmi for prosperity. Spiritually, it represents the inner light that protects us from spiritual darkness. The lighting of diyas (lamps) signifies removing darkness from our lives and welcoming prosperity, wisdom, and happiness. It's a time for new beginnings, clearing old debts, and strengthening family bonds.",
    "rituals": [
      "Taking an early morning oil bath (Abhyanga Snanam)",
      "Lighting oil lamps (diyas) at entrances, windows, and around the house",
      "Performing Lakshmi Puja in the evening to welcome prosperity",
      "Bursting firecrackers to celebrate the victory of good over evil",
      "Decorating homes with colorful rangoli and lights",
      "Wearing new clothes and exchanging gifts with family and friends",
      "Preparing special sweets and savories",
      "Giving charity to the poor and needy"
    ],
    "celebration": "Deepavali is celebrated over three to five days. The main day starts with an oil bath before sunrise. Homes are cleaned, decorated with rangoli, and illuminated with countless diyas and electric lights. In the evening, Lakshmi Puja is performed with flowers, fruits, and sweets. Business ledgers are closed and new books are started. Families exchange gifts, share sweets, and burst firecrackers. The night sky lights up with fireworks, and the atmosphere is filled with joy and celebration.",
    "tithi": "Ashwina/Kartika Amavasya",
    "nakshatra": "Varies",
    "masa": "Ashwina/Kartika",
    "paksha": "Amavasya (New Moon)"
  },
  "karthika-masam": {
    "name": "Karthika Masam Begins",
    "date": "2026-11-01",
    "day": "Sunday",
    "description": "Karthika Masam is the most sacred month in the Telugu calendar, dedicated to Lord Shiva and Lord Vishnu. Beginning from the day after Deepavali and lasting for 30 days, this month is considered highly auspicious for spiritual practices, charity, and performing religious rituals. Devotees observe various vratas (vows) and visit temples daily during this holy month.",
    "significance": "Karthika Masam is mentioned in Hindu scriptures as the month most beloved by Lord Vishnu. Lighting lamps (deepas) during this month is believed to bring immense spiritual merit. The month includes several important festivals and observances. Bathing in sacred rivers, especially the Godavari and Krishna, during Karthika Masam is considered highly purifying. Any good deed performed during this month is said to yield manifold benefits.",
    "rituals": [
      "Lighting oil lamps (Karthika Deepam) every evening at home and temples",
      "Taking early morning baths, preferably in sacred rivers",
      "Visiting temples daily, especially Shiva and Vishnu temples",
      "Observing Somavaram (Monday) and Kartik Purnima vratas",
      "Reading sacred texts like Bhagavata Purana and Shiva Purana",
      "Feeding the poor and giving charity regularly",
      "Performing Tulsi puja and circumambulating the Tulsi plant",
      "Observing dietary restrictions and sattvic food habits"
    ],
    "celebration": "Throughout Karthika Masam, Telugu households light oil lamps at dusk, believing it brings prosperity and removes darkness from lives. Many devotees wake up early for Brahma Muhurta bath and temple visits. Special pujas are organized in temples with elaborate decorations. The month culminates on Karthika Purnima with grand celebrations, including the lighting of huge lamps atop temple towers. Families come together for evening prayers and lamp lighting ceremonies.",
    "tithi": "Karthika Masam - Full Month",
    "nakshatra": "Varies",
    "masa": "Karthika",
    "paksha": "Full Month Observance"
  },
  "christmas": {
    "name": "Christmas",
    "date": "2026-12-25",
    "day": "Friday",
    "description": "Christmas celebrates the birth of Jesus Christ, the central figure of Christianity. While primarily a Christian festival, Christmas is celebrated across India with great joy and enthusiasm by people of all faiths. The festival promotes messages of love, peace, compassion, and giving. In Telugu states, Christmas is a public holiday and is celebrated with decorations, carols, and festive gatherings.",
    "significance": "Christmas represents the arrival of hope and light into the world through the birth of Jesus Christ. The festival embodies universal values of love, forgiveness, charity, and goodwill toward all. For Christians, it commemorates God's gift of His son to humanity for salvation. The spirit of Christmas encourages people to spread joy, help the needy, and strengthen family bonds. The celebration brings communities together in harmony and brotherhood.",
    "rituals": [
      "Attending midnight mass on Christmas Eve in churches",
      "Decorating Christmas trees with lights, stars, and ornaments",
      "Setting up nativity scenes (cribs) depicting Jesus's birth",
      "Singing Christmas carols and hymns",
      "Exchanging gifts among family and friends",
      "Preparing special Christmas feast with traditional delicacies",
      "Decorating homes with stars, bells, and colorful lights",
      "Participating in charity and helping the less fortunate"
    ],
    "celebration": "Christmas celebrations in Telugu regions begin weeks in advance with decorations and preparations. Churches hold special midnight masses on Christmas Eve with beautiful carol singing. Homes are decorated with Christmas trees, stars, and lights. On Christmas morning, families exchange gifts and prepare special meals. Christmas cakes, plum cakes, and traditional sweets are shared with neighbors and friends. Community gatherings, cultural programs, and charity events are organized to spread the Christmas cheer and message of love.",
    "tithi": "N/A (Gregorian Calendar)",
    "nakshatra": "N/A",
    "masa": "December",
    "paksha": "N/A (Christian Festival)"
  }
}
